149998/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    frontback
    {
        type            empty;
        inGroups 1(empty);
        nFaces          299996;
        startFace       224361;
    }
    topbottom
    {
        type            patch;
        physicalType    patch;
        nFaces          446;
        startFace       524357;
    }
    outlet
    {
        type            patch;
        physicalType    patch;
        nFaces          112;
        startFace       524803;
    }
    inlet
    {
        type            patch;
        physicalType    patch;
        nFaces          112;
        startFace       524915;
    }
    walls
    {
        type            wall;
      inGroups 1(wall);
        nFaces          602;
        startFace       525027;
    }
)

// ************************************************************************* //
